# -------------------------------------------------------------------------------------
# [섹션 1] 모듈 임포트
# -------------------------------------------------------------------------------------
import threading
import time
from .image_manager import ImageManager
from .detect_analyzer import DetectAnalyzer
from .merger import Merger

# -------------------------------------------------------------------------------------
# [섹션 2] 전역 설정 (네트워크 주소 및 포트)
# -------------------------------------------------------------------------------------

# - # 로봇으로부터 이미지 수신을 위한 리스닝 주소 (모든 IP에서 수신)
SYSTEM_HOST = ""